Revit 2024 API
AssemblyInstance.AreElementsValidForAssembly Method
 Identifies if provided assembly members are valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool AreElementsValidForAssembly(
	Document document,
	ICollection<ElementId> assemblyMemberIds,
	ElementId assemblyId
)
Visual Basic
Public Shared Function AreElementsValidForAssembly ( _
	document As Document, _
	assemblyMemberIds As ICollection(Of ElementId), _
	assemblyId As ElementId _
) As Boolean
Visual C++
public:
static bool AreElementsValidForAssembly(
	Document^ document,
	ICollection<ElementId^>^ assemblyMemberIds,
	ElementId^ assemblyId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
assemblyMemberIds
Type: System.Collections.Generic.ICollection<ElementId>
 Element ids to be tested for validity for membership of an assembly instance.
assemblyId
Type: Autodesk.Revit.DB.ElementId
 Id of the existing assembly to add components to. If invalid, the method return whether the components can be added to a new assembly
Return Value
 True if all member ids are valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace